#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ai_search.restapi_object.organizations_index_02 will be created
  + resource "restapi_object" "organizations_index_02" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + analyzers             = [
                  + {
                      + "@odata.type" = "#Microsoft.Azure.Search.CustomAnalyzer"
                      + charFilters   = [
                          + "removeWhitespace",
                        ]
                      + name          = "organizationCustomAnalyzer"
                      + tokenFilters  = [
                          + "italianStopWord",
                          + "asciifolding",
                          + "lowercase",
                        ]
                      + tokenizer     = "customNGramTokenizer"
                    },
                ]
              + charFilters           = [
                  + {
                      + "@odata.type" = "#Microsoft.Azure.Search.MappingCharFilter"
                      + mappings      = [
                          + "\\u0020=>",
                        ]
                      + name          = "removeWhitespace"
                    },
                ]
              + corsOptions           = null
              + defaultScoringProfile = null
              + encryptionKey         = null
              + fields                = [
                  + {
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = true
                      + indexAnalyzer       = null
                      + key                 = true
                      + name                = "id"
                      + retrievable         = true
                      + searchAnalyzer      = null
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + analyzer            = "organizationCustomAnalyzer"
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = false
                      + key                 = false
                      + name                = "name"
                      + retrievable         = true
                      + searchable          = true
                      + sortable            = true
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = true
                      + key                 = false
                      + name                = "scope"
                      + retrievable         = false
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = false
                      + key                 = false
                      + name                = "fiscal_code"
                      + retrievable         = true
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                ]
              + name                  = "idx-organization-02"
              + scoringProfiles       = [
                  + {
                      + functionAggregation = "sum"
                      + functions           = [
                          + {
                              + boost         = 3
                              + distance      = null
                              + fieldName     = "scope"
                              + freshness     = null
                              + interpolation = "constant"
                              + magnitude     = null
                              + tag           = {
                                  + tagsParameter = "boostScope"
                                }
                              + type          = "tag"
                            },
                        ]
                      + name                = "BoostScope"
                      + text                = null
                    },
                ]
              + semantic              = null
              + similarity            = {
                  + "@odata.type" = "#Microsoft.Azure.Search.BM25Similarity"
                  + b             = null
                  + k1            = null
                }
              + suggesters            = []
              + tokenFilters          = [
                  + {
                      + "@odata.type"  = "#Microsoft.Azure.Search.StopwordsTokenFilter"
                      + ignoreCase     = false
                      + name           = "italianStopWord"
                      + removeTrailing = true
                      + stopwords      = []
                      + stopwordsList  = "italian"
                    },
                ]
              + tokenizers            = [
                  + {
                      + "@odata.type" = "#Microsoft.Azure.Search.NGramTokenizer"
                      + maxGram       = 5
                      + minGram       = 3
                      + name          = "customNGramTokenizer"
                      + tokenChars    = []
                    },
                ]
              + vectorSearch          = null
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexes"
      + query_string    = "api-version=2023-11-01"
    }

  # module.ai_search.restapi_object.organizations_indexer_02 will be created
  + resource "restapi_object" "organizations_indexer_02" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexers"
      + query_string    = "api-version=2023-11-01"
    }

  # module.ai_search.restapi_object.services_index_02 will be created
  + resource "restapi_object" "services_index_02" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + analyzers             = []
              + charFilters           = []
              + corsOptions           = null
              + defaultScoringProfile = null
              + encryptionKey         = null
              + fields                = [
                  + {
                      + analyzer            = null
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = true
                      + indexAnalyzer       = null
                      + key                 = true
                      + name                = "id"
                      + retrievable         = true
                      + searchAnalyzer      = null
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + analyzer            = null
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = false
                      + indexAnalyzer       = null
                      + key                 = false
                      + name                = "name"
                      + retrievable         = true
                      + searchAnalyzer      = null
                      + searchable          = false
                      + sortable            = true
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = true
                      + key                 = false
                      + name                = "orgFiscalCode"
                      + retrievable         = false
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.String"
                      + vectorSearchProfile = null
                    },
                  + {
                      + analyzer            = null
                      + dimensions          = null
                      + facetable           = false
                      + filterable          = false
                      + indexAnalyzer       = null
                      + key                 = false
                      + name                = "version"
                      + retrievable         = true
                      + searchAnalyzer      = null
                      + searchable          = false
                      + sortable            = false
                      + synonymMaps         = []
                      + type                = "Edm.Int32"
                      + vectorSearchProfile = null
                    },
                ]
              + name                  = "idx-services-02"
              + scoringProfiles       = []
              + semantic              = null
              + similarity            = {
                  + "@odata.type" = "#Microsoft.Azure.Search.BM25Similarity"
                  + b             = null
                  + k1            = null
                }
              + suggesters            = []
              + tokenFilters          = []
              + tokenizers            = []
              + vectorSearch          = null
            }
        )
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexes"
      + query_string    = "api-version=2023-11-01"
    }

  # module.ai_search.restapi_object.services_lifecycle_indexer_02 will be created
  + resource "restapi_object" "services_lifecycle_indexer_02" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexers"
      + query_string    = "api-version=2023-11-01"
    }

  # module.ai_search.restapi_object.services_publication_indexer_02 will be created
  + resource "restapi_object" "services_publication_indexer_02" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_response = (known after apply)
      + data            = (known after apply)
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/indexers"
      + query_string    = "api-version=2023-11-01"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
